# ML_CA2: Income Prediction and Sentiment Analysis

In [1]:
# Import libraries
import pandas as pd

# Load dataset
file_path = r"C:\Users\Administrator\Desktop\ML-CA2\BankRecords.csv"
df = pd.read_csv(file_path)

# Display first 5 rows
df.head()

,ID,Age,Experience(Years),Income(Thousands's),Sort Code,Family,Credit Score,Education,Mortgage(Thousands's),Personal Loan,Securities Account,CD Account,Online Banking,CreditCard
0,1,25,1,49,91107,4,1.6,Diploma,0,No,Yes,No,No,No
1,2,45,19,34,90089,3,1.5,Diploma,0,No,Yes,No,No,No
2,3,39,15,11,94720,1,1.0,Diploma,0,No,No,No,No,No
3,4,35,9,100,94112,1,2.7,Degree,0,No,No,No,No,No
4,5,35,8,45,91330,4,1.0,Degree,0,No,No,No,No,Yes

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     5000 non-null   int64
 1   Age                    5000 non-null   int64
 2   Experience(Years)      5000 non-null   int64
 3   Income(Thousands's)    5000 non-null   int64
 4   Sort Code              5000 non-null   int64
 5   Family                 5000 non-null   int64
 6   Credit Score           5000 non-null   float64
 7   Education              5000 non-null   object
 8   Mortgage(Thousands's)  5000 non-null   int64
 9   Personal Loan          5000 non-null   object
 10  Securities Account     5000 non-null   object
 11  CD Account             5000 non-null   object
 12  Online Banking         5000 non-null   object
 13  CreditCard             5000 non-null   object
dtypes: float64(1), int64(7), object(6)
memory usage: 547.0+ KB

To understand the structure and contents of the dataset, I display the first five rows using `head()` and summarize the data types and non-null counts using `info()`. This provides a quick overview of overall shape.

In [4]:
# Check basic statistics of numeric features
print("\nðŸ”¹ Statistical Summary of Numeric Columns")
display(df.describe())

ðŸ”¹ Statistical Summary of Numeric Columns

,ID,Age,Experience(Years),Income(Thousands's),Sort Code,Family,Credit Score,Mortgage(Thousands's)
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000
mean,2500.500000,45.338400,20.104600,73.774200,93152.503000,2.396400,1.937913,56.498800
std,1443.520003,11.463166,11.467954,46.033729,2121.852197,1.147663,1.747666,101.713802
min,1.000000,23.000000,-3.000000,8.000000,9307.000000,1.000000,0.000000,0.000000
25%,1250.750000,35.000000,10.000000,39.000000,91911.000000,1.000000,0.700000,0.000000
50%,2500.500000,45.000000,20.000000,64.000000,93437.000000,2.000000,1.500000,0.000000
75%,3750.250000,55.000000,30.000000,98.000000,94608.000000,3.000000,2.500000,101.000000
max,5000.000000,67.000000,43.000000,224.000000,96651.000000,4.000000,10.000000,635.000000

####  Checking Missing Values

In [5]:
# Check for missing values in each column
missing_summary = df.isnull().sum()
# Only display columns that actually have missing values (i.e., > 0)
print("Missing Values per Column:\n", missing_summary[missing_summary > 0])

Missing Values per Column:
 Series([], dtype: int64)

I used `isnull().sum()` to count missing values in each column. This ensures the dataset is complete before further processing.

#### Checking Duplicates Rows

In [6]:
# Detect duplicate rows
duplicates = df.duplicated().sum()
print(f"\nTotal Duplicate Rows: {duplicates}")

Total Duplicate Rows: 0

I checked for duplicate records to avoid redundancy.